/*
SQLyog Ultimate v12.09 (64 bit)
MySQL - 5.7.20-log : Database - crcc
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`crcc` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `crcc`;

/*Table structure for table `g_concrete_data` */

DROP TABLE IF EXISTS `g_concrete_data`;

CREATE TABLE `g_concrete_data` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `battery` varchar(50) NOT NULL DEFAULT '' COMMENT '电池情况',
  `temperature` varchar(1000) NOT NULL DEFAULT '' COMMENT '传感器温度',
  `model` varchar(50) NOT NULL DEFAULT '' COMMENT '模式',
  `device_id` varchar(100) NOT NULL DEFAULT '' COMMENT '设备id',
  `create_time` int(11) NOT NULL DEFAULT '0' COMMENT '创建时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=20 DEFAULT CHARSET=utf8 COMMENT='砼传感器接受数据';

/*Data for the table `g_concrete_data` */

insert  into `g_concrete_data`(`id`,`battery`,`temperature`,`model`,`device_id`,`create_time`) values (1,'电池电压正常','[\"0\",\"0\",\"0\",\"0\",\"22\",\"22.1\",\"22\",\"0\"]','单机模式','460045354505713',1534212100),(2,'电池电压正常','[\"21.5\",\"21.8\",\"21.8\",\"21.8\",\"0\",\"0\",\"0\",\"0\"]','单机模式','460045354505714',1534213445),(3,'电池电压正常','[\"0\",\"0\",\"0\",\"0\",\"21.6\",\"21.8\",\"21.6\",\"42.3\"]','单机模式','460045354505713',1534213777),(4,'电池电压正常','[\"0\",\"0\",\"0\",\"0\",\"22\",\"22\",\"22\",\"0\"]','单机模式','460045354505713',1534215424),(5,'电池电压正常','[\"22.1\",\"22.2\",\"22.2\",\"22.2\",\"0\",\"0\",\"0\",\"0\"]','单机模式','460045354505714',1534215516),(6,'电池电压正常','[\"0\",\"0\",\"0\",\"0\",\"22.5\",\"22.5\",\"22.4\",\"22.5\"]','单机模式','460045354505713',1534219690),(7,'电池电压正常','[\"22.6\",\"22.5\",\"22.6\",\"22.6\",\"0\",\"0\",\"0\",\"0\"]','单机模式','460045354505714',1534219933),(8,'电池电压正常','[\"0\",\"0\",\"0\",\"0\",\"22.4\",\"22.4\",\"22.3\",\"22.4\"]','单机模式','460045354505713',1534221337),(9,'电池电压正常','[\"22.6\",\"22.6\",\"22.5\",\"22.6\",\"0\",\"0\",\"0\",\"0\"]','单机模式','460045354505714',1534222007),(10,'电池电压正常','[\"0\",\"0\",\"0\",\"0\",\"22.5\",\"22.6\",\"22.4\",\"22.5\"]','单机模式','460045354505713',1534222981),(11,'电池电压正常','[\"22.6\",\"22.8\",\"22.6\",\"22.8\",\"0\",\"0\",\"0\",\"0\"]','单机模式','460045354505714',1534224108),(12,'电池电压正常','[\"0\",\"0\",\"0\",\"0\",\"22.7\",\"22.6\",\"22.6\",\"22.6\"]','单机模式','460045354505713',1534224628),(13,'电池电压正常','[\"22.7\",\"22.8\",\"22.8\",\"22.9\",\"0\",\"0\",\"0\",\"0\"]','单机模式','460045354505714',1534226208),(14,'电池电压正常','[\"0\",\"0\",\"0\",\"0\",\"22.8\",\"22.8\",\"22.6\",\"22.8\"]','单机模式','460045354505713',1534226275),(15,'电池电压正常','[\"0\",\"0\",\"0\",\"0\",\"23\",\"23.1\",\"22.9\",\"23.1\"]','单机模式','460045354505713',1534227922),(16,'电池电压正常','[\"23\",\"22.9\",\"22.8\",\"23.2\",\"0\",\"0\",\"0\",\"0\"]','单机模式','460045354505714',1534228099),(17,'电池电压正常','[\"0\",\"0\",\"0\",\"0\",\"23.3\",\"23.3\",\"23.1\",\"23.3\"]','单机模式','460045354505713',1534229568),(18,'电池电压正常','[\"23.3\",\"23.3\",\"23.2\",\"23.6\",\"0\",\"0\",\"0\",\"0\"]','单机模式','460045354505714',1534230170),(19,'电池电压正常','[\"0\",\"0\",\"0\",\"0\",\"23.6\",\"23.6\",\"23.5\",\"23.6\"]','单机模式','460045354505713',1534231213);

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
